Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create
~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.test-k8s-cluster.module.eks_cluster.aws_eks_cluster.default[0] will be created
+ resource "aws_eks_cluster" "default" {
      + arn                   = (known after apply)
      + certificate_authority = (known after apply)
      + created_at            = (known after apply)
      + endpoint              = (known after apply)
      + id                    = (known after apply)
      + identity              = (known after apply)
      + name                  = "bemit-testing-johnholm-cluster"
      + platform_version      = (known after apply)
      + role_arn              = (known after apply)
      + status                = (known after apply)
      + tags                  = {
          + "Attributes" = "cluster"
          + "Name"       = "bemit-testing-johnholm-cluster"
          + "Namespace"  = "bemit"
          + "Stage"      = "testing"
        }
      + version               = (known after apply)

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = [
              + "0.0.0.0/0",
            ]
          + security_group_ids        = (known after apply)
          + subnet_ids                = [
              + "subnet-02b402d2224b8504d",
              + "subnet-03f7cbd6793880802",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # module.test-k8s-cluster.module.eks_cluster.aws_iam_role.default[0] must be replaced
+/- resource "aws_iam_role" "default" {
      ~ arn                   = "arn:aws:iam::259016875510:role/bemit-testing-test-k8s-cluster-cluster" -> (known after apply)
      ~ assume_role_policy    = jsonencode( # whitespace changes
            {
                Statement = [
                    {
                        Action    = "sts:AssumeRole"
                        Effect    = "Allow"
                        Principal = {
                            Service = "eks.amazonaws.com"
                        }
                        Sid       = ""
                    },
                ]
                Version   = "2012-10-17"
            }
        )
      ~ create_date           = "2020-02-19T16:35:57Z" -> (known after apply)
        force_detach_policies = false
      ~ id                    = "bemit-testing-test-k8s-cluster-cluster" -> (known after apply)
        max_session_duration  = 3600
      ~ name                  = "bemit-testing-test-k8s-cluster-cluster" -> "bemit-testing-johnholm-cluster" # forces replacement
        path                  = "/"
      ~ tags                  = {
            "Attributes" = "cluster"
          ~ "Name"       = "bemit-testing-test-k8s-cluster-cluster" -> "bemit-testing-johnholm-cluster"
            "Namespace"  = "bemit"
            "Stage"      = "testing"
        }
      ~ unique_id             = "AROATYTU33X3FSCBKQUMG" -> (known after apply)
    }

  # module.test-k8s-cluster.module.eks_cluster.aws_iam_role_policy_attachment.amazon_eks_cluster_policy[0] must be replaced
+/- resource "aws_iam_role_policy_attachment" "amazon_eks_cluster_policy" {
      ~ id         = "bemit-testing-test-k8s-cluster-cluster-20200219163558565000000005" -> (known after apply)
        policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      ~ role       = "bemit-testing-test-k8s-cluster-cluster" -> "bemit-testing-johnholm-cluster" # forces replacement
    }

  # module.test-k8s-cluster.module.eks_cluster.aws_iam_role_policy_attachment.amazon_eks_service_policy[0] must be replaced
+/- resource "aws_iam_role_policy_attachment" "amazon_eks_service_policy" {
      ~ id         = "bemit-testing-test-k8s-cluster-cluster-20200219163558556300000004" -> (known after apply)
        policy_arn = "arn:aws:iam::aws:policy/AmazonEKSServicePolicy"
      ~ role       = "bemit-testing-test-k8s-cluster-cluster" -> "bemit-testing-johnholm-cluster" # forces replacement
    }

  # module.test-k8s-cluster.module.eks_cluster.aws_security_group.default[0] must be replaced
+/- resource "aws_security_group" "default" {
      ~ arn                    = "arn:aws:ec2:eu-west-1:259016875510:security-group/sg-0a488b7442ec50d2e" -> (known after apply)
        description            = "Security Group for EKS cluster"
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow all egress traffic"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> (known after apply)
      ~ id                     = "sg-0a488b7442ec50d2e" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "Allow the cluster to receive communication from the worker nodes"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = [
                  - "sg-036d6c7944f628416",
                ]
              - self             = false
              - to_port          = 0
            },
        ] -> (known after apply)
      ~ name                   = "bemit-testing-test-k8s-cluster-cluster" -> "bemit-testing-johnholm-cluster" # forces replacement
      ~ owner_id               = "259016875510" -> (known after apply)
        revoke_rules_on_delete = false
      ~ tags                   = {
            "Attributes" = "cluster"
          ~ "Name"       = "bemit-testing-test-k8s-cluster-cluster" -> "bemit-testing-johnholm-cluster"
            "Namespace"  = "bemit"
            "Stage"      = "testing"
        }
        vpc_id                 = "vpc-01464930072e8714a"
    }

  # module.test-k8s-cluster.module.eks_cluster.aws_security_group_rule.egress[0] must be replaced
-/+ resource "aws_security_group_rule" "egress" {
        cidr_blocks              = [
            "0.0.0.0/0",
        ]
        description              = "Allow all egress traffic"
        from_port                = 0
      ~ id                       = "sgrule-125085342" -> (known after apply)
      - ipv6_cidr_blocks         = [] -> null
      - prefix_list_ids          = [] -> null
        protocol                 = "-1"
      ~ security_group_id        = "sg-0a488b7442ec50d2e" -> (known after apply) # forces replacement
        self                     = false
      + source_security_group_id = (known after apply)
        to_port                  = 0
        type                     = "egress"
    }

  # module.test-k8s-cluster.module.eks_cluster.aws_security_group_rule.ingress_workers[0] must be replaced
-/+ resource "aws_security_group_rule" "ingress_workers" {
      - cidr_blocks              = [] -> null
        description              = "Allow the cluster to receive communication from the worker nodes"
        from_port                = 0
      ~ id                       = "sgrule-3695012317" -> (known after apply)
      - ipv6_cidr_blocks         = [] -> null
      - prefix_list_ids          = [] -> null
        protocol                 = "-1"
      ~ security_group_id        = "sg-0a488b7442ec50d2e" -> (known after apply) # forces replacement
        self                     = false
      ~ source_security_group_id = "sg-036d6c7944f628416" -> (known after apply) # forces replacement
      ~ to_port                  = 0 -> 65535
        type                     = "ingress"
    }

  # module.test-k8s-cluster.module.eks_cluster.local_file.configmap_auth[0] will be created
+ resource "local_file" "configmap_auth" {
      + content              = <<~EOT
            apiVersion: v1
            kind: ConfigMap
            metadata:
              name: aws-auth
              namespace: kube-system
            data:
              mapRoles: |
                - "groups":
                  - "system:bootstrappers"
                  - "system:nodes"
                  "rolearn": "arn:aws:iam::259016875510:role/bemit-testing-test-k8s-cluster-workers"
                  "username": "system:node:{{EC2PrivateDNSName}}"
            
            
            
        EOT
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "~/.terraform/configmap-auth.yaml"
      + id                   = (known after apply)
    }

  # module.test-k8s-cluster.module.eks_cluster.null_resource.apply_configmap_auth[0] will be created
+ resource "null_resource" "apply_configmap_auth" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # module.test-k8s-cluster.module.eks_workers.data.template_file.userdata[0] will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "userdata"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = <<~EOT
            #!/bin/bash
            
            # userdata for EKS worker nodes to properly configure Kubernetes applications on EC2 instances
            # https://docs.aws.amazon.com/eks/latest/userguide/launch-workers.html
            # https://aws.amazon.com/blogs/opensource/improvements-eks-worker-node-provisioning/
            # https://github.com/awslabs/amazon-eks-ami/blob/master/files/bootstrap.sh#L97
            
            ${before_cluster_joining_userdata}
            
            export KUBELET_EXTRA_ARGS=${bootstrap_extra_args}
            
            /etc/eks/bootstrap.sh --apiserver-endpoint '${cluster_endpoint}' --b64-cluster-ca '${certificate_authority_data}' '${cluster_name}'
            
            ${after_cluster_joining_userdata}
        EOT
      + vars     = {
          + "after_cluster_joining_userdata"  = ""
          + "before_cluster_joining_userdata" = ""
          + "bootstrap_extra_args"            = ""
          + "certificate_authority_data"      = (known after apply)
          + "cluster_endpoint"                = (known after apply)
          + "cluster_name"                    = "bemit-testing-johnholm-cluster"
        }
    }

  # module.test-k8s-cluster.module.eks_workers.aws_iam_instance_profile.default[0] must be replaced
+/- resource "aws_iam_instance_profile" "default" {
      ~ arn         = "arn:aws:iam::259016875510:instance-profile/bemit-testing-test-k8s-cluster-workers" -> (known after apply)
      ~ create_date = "2020-02-19T16:35:58Z" -> (known after apply)
      ~ id          = "bemit-testing-test-k8s-cluster-workers" -> (known after apply)
      ~ name        = "bemit-testing-test-k8s-cluster-workers" -> "bemit-testing-johnholm-workers" # forces replacement
        path        = "/"
      ~ role        = "bemit-testing-test-k8s-cluster-workers" -> "bemit-testing-johnholm-workers"
      ~ roles       = [
          - "bemit-testing-test-k8s-cluster-workers",
        ] -> (known after apply)
      ~ unique_id   = "AIPATYTU33X3HVJSRDU2W" -> (known after apply)
    }

  # module.test-k8s-cluster.module.eks_workers.aws_iam_role.default[0] must be replaced
+/- resource "aws_iam_role" "default" {
      ~ arn                   = "arn:aws:iam::259016875510:role/bemit-testing-test-k8s-cluster-workers" -> (known after apply)
      ~ assume_role_policy    = jsonencode( # whitespace changes
            {
                Statement = [
                    {
                        Action    = "sts:AssumeRole"
                        Effect    = "Allow"
                        Principal = {
                            Service = "ec2.amazonaws.com"
                        }
                        Sid       = ""
                    },
                ]
                Version   = "2012-10-17"
            }
        )
      ~ create_date           = "2020-02-19T16:35:57Z" -> (known after apply)
        force_detach_policies = false
      ~ id                    = "bemit-testing-test-k8s-cluster-workers" -> (known after apply)
        max_session_duration  = 3600
      ~ name                  = "bemit-testing-test-k8s-cluster-workers" -> "bemit-testing-johnholm-workers" # forces replacement
        path                  = "/"
      ~ tags                  = {
            "Attributes"                                                   = "workers"
          ~ "Name"                                                         = "bemit-testing-test-k8s-cluster-workers" -> "bemit-testing-johnholm-workers"
            "Namespace"                                                    = "bemit"
            "Stage"                                                        = "testing"
          + "kubernetes.io/cluster/bemit-testing-johnholm-cluster"         = "owned"
          - "kubernetes.io/cluster/bemit-testing-test-k8s-cluster-cluster" = "owned" -> null
        }
      ~ unique_id             = "AROATYTU33X3EUOC3MTNO" -> (known after apply)
    }

  # module.test-k8s-cluster.module.eks_workers.aws_iam_role_policy_attachment.amazon_ec2_container_registry_read_only[0] must be replaced
-/+ resource "aws_iam_role_policy_attachment" "amazon_ec2_container_registry_read_only" {
      ~ id         = "bemit-testing-test-k8s-cluster-workers-20200219163558540100000003" -> (known after apply)
        policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      ~ role       = "bemit-testing-test-k8s-cluster-workers" -> "bemit-testing-johnholm-workers" # forces replacement
    }

  # module.test-k8s-cluster.module.eks_workers.aws_iam_role_policy_attachment.amazon_eks_cni_policy[0] must be replaced
-/+ resource "aws_iam_role_policy_attachment" "amazon_eks_cni_policy" {
      ~ id         = "bemit-testing-test-k8s-cluster-workers-20200219163558501100000001" -> (known after apply)
        policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      ~ role       = "bemit-testing-test-k8s-cluster-workers" -> "bemit-testing-johnholm-workers" # forces replacement
    }

  # module.test-k8s-cluster.module.eks_workers.aws_iam_role_policy_attachment.amazon_eks_worker_node_policy[0] must be replaced
-/+ resource "aws_iam_role_policy_attachment" "amazon_eks_worker_node_policy" {
      ~ id         = "bemit-testing-test-k8s-cluster-workers-20200219163558518200000002" -> (known after apply)
        policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      ~ role       = "bemit-testing-test-k8s-cluster-workers" -> "bemit-testing-johnholm-workers" # forces replacement
    }

  # module.test-k8s-cluster.module.eks_workers.aws_security_group.default[0] must be replaced
+/- resource "aws_security_group" "default" {
      ~ arn                    = "arn:aws:ec2:eu-west-1:259016875510:security-group/sg-036d6c7944f628416" -> (known after apply)
        description            = "Security Group for EKS worker nodes"
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow all egress traffic"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> (known after apply)
      ~ id                     = "sg-036d6c7944f628416" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "Allow nodes to communicate with each other"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = true
              - to_port          = 0
            },
          - {
              - cidr_blocks      = []
              - description      = "Allow worker kubelets and pods to receive communication from the cluster control plane"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = [
                  - "sg-0a488b7442ec50d2e",
                ]
              - self             = false
              - to_port          = 0
            },
        ] -> (known after apply)
      ~ name                   = "bemit-testing-test-k8s-cluster-workers" -> "bemit-testing-johnholm-workers" # forces replacement
      ~ owner_id               = "259016875510" -> (known after apply)
        revoke_rules_on_delete = false
      ~ tags                   = {
            "Attributes"                                                   = "workers"
          ~ "Name"                                                         = "bemit-testing-test-k8s-cluster-workers" -> "bemit-testing-johnholm-workers"
            "Namespace"                                                    = "bemit"
            "Stage"                                                        = "testing"
          + "kubernetes.io/cluster/bemit-testing-johnholm-cluster"         = "owned"
          - "kubernetes.io/cluster/bemit-testing-test-k8s-cluster-cluster" = "owned" -> null
        }
        vpc_id                 = "vpc-01464930072e8714a"
    }

  # module.test-k8s-cluster.module.eks_workers.aws_security_group_rule.egress[0] must be replaced
-/+ resource "aws_security_group_rule" "egress" {
        cidr_blocks              = [
            "0.0.0.0/0",
        ]
        description              = "Allow all egress traffic"
        from_port                = 0
      ~ id                       = "sgrule-1162963888" -> (known after apply)
      - ipv6_cidr_blocks         = [] -> null
      - prefix_list_ids          = [] -> null
        protocol                 = "-1"
      ~ security_group_id        = "sg-036d6c7944f628416" -> (known after apply) # forces replacement
        self                     = false
      + source_security_group_id = (known after apply)
        to_port                  = 0
        type                     = "egress"
    }

  # module.test-k8s-cluster.module.eks_workers.aws_security_group_rule.ingress_cluster[0] must be replaced
-/+ resource "aws_security_group_rule" "ingress_cluster" {
      - cidr_blocks              = [] -> null
        description              = "Allow worker kubelets and pods to receive communication from the cluster control plane"
        from_port                = 0
      ~ id                       = "sgrule-3065629212" -> (known after apply)
      - ipv6_cidr_blocks         = [] -> null
      - prefix_list_ids          = [] -> null
        protocol                 = "-1"
      ~ security_group_id        = "sg-036d6c7944f628416" -> (known after apply) # forces replacement
        self                     = false
      ~ source_security_group_id = "sg-0a488b7442ec50d2e" -> (known after apply) # forces replacement
      ~ to_port                  = 0 -> 65535
        type                     = "ingress"
    }

  # module.test-k8s-cluster.module.eks_workers.aws_security_group_rule.ingress_self[0] must be replaced
-/+ resource "aws_security_group_rule" "ingress_self" {
      - cidr_blocks              = [] -> null
        description              = "Allow nodes to communicate with each other"
        from_port                = 0
      ~ id                       = "sgrule-908723054" -> (known after apply)
      - ipv6_cidr_blocks         = [] -> null
      - prefix_list_ids          = [] -> null
        protocol                 = "-1"
      ~ security_group_id        = "sg-036d6c7944f628416" -> (known after apply) # forces replacement
        self                     = false
      ~ source_security_group_id = "sg-036d6c7944f628416" -> (known after apply) # forces replacement
      ~ to_port                  = 0 -> 65535
        type                     = "ingress"
    }

  # module.test-k8s-cluster.module.subnets.aws_network_acl.private[0] will be updated in-place
~ resource "aws_network_acl" "private" {
        egress     = [
            {
                action          = "allow"
                cidr_block      = "0.0.0.0/0"
                from_port       = 0
                icmp_code       = 0
                icmp_type       = 0
                ipv6_cidr_block = ""
                protocol        = "-1"
                rule_no         = 100
                to_port         = 0
            },
        ]
        id         = "acl-0b7003e55c2a452a5"
        ingress    = [
            {
                action          = "allow"
                cidr_block      = "0.0.0.0/0"
                from_port       = 0
                icmp_code       = 0
                icmp_type       = 0
                ipv6_cidr_block = ""
                protocol        = "-1"
                rule_no         = 100
                to_port         = 0
            },
        ]
        owner_id   = "259016875510"
        subnet_ids = [
            "subnet-00946e3fa0a8dd528",
            "subnet-0dfa93d1131c54381",
        ]
      ~ tags       = {
            "Attributes"                                                   = "private"
          ~ "Name"                                                         = "bemit-testing-test-k8s-cluster" -> "bemit-testing-johnholm"
            "Namespace"                                                    = "bemit"
            "Stage"                                                        = "testing"
            "cpco.io/subnet/type"                                          = "private"
          + "kubernetes.io/cluster/bemit-testing-johnholm-cluster"         = "shared"
          - "kubernetes.io/cluster/bemit-testing-test-k8s-cluster-cluster" = "shared" -> null
        }
        vpc_id     = "vpc-01464930072e8714a"
    }

  # module.test-k8s-cluster.module.subnets.aws_network_acl.public[0] will be updated in-place
~ resource "aws_network_acl" "public" {
        egress     = [
            {
                action          = "allow"
                cidr_block      = "0.0.0.0/0"
                from_port       = 0
                icmp_code       = 0
                icmp_type       = 0
                ipv6_cidr_block = ""
                protocol        = "-1"
                rule_no         = 100
                to_port         = 0
            },
        ]
        id         = "acl-0e88b5c0f310efd60"
        ingress    = [
            {
                action          = "allow"
                cidr_block      = "0.0.0.0/0"
                from_port       = 0
                icmp_code       = 0
                icmp_type       = 0
                ipv6_cidr_block = ""
                protocol        = "-1"
                rule_no         = 100
                to_port         = 0
            },
        ]
        owner_id   = "259016875510"
        subnet_ids = [
            "subnet-02b402d2224b8504d",
            "subnet-03f7cbd6793880802",
        ]
      ~ tags       = {
            "Attributes"                                                   = "public"
          ~ "Name"                                                         = "bemit-testing-test-k8s-cluster" -> "bemit-testing-johnholm"
            "Namespace"                                                    = "bemit"
            "Stage"                                                        = "testing"
            "cpco.io/subnet/type"                                          = "public"
          + "kubernetes.io/cluster/bemit-testing-johnholm-cluster"         = "shared"
          - "kubernetes.io/cluster/bemit-testing-test-k8s-cluster-cluster" = "shared" -> null
        }
        vpc_id     = "vpc-01464930072e8714a"
    }

  # module.test-k8s-cluster.module.subnets.aws_route_table.private[0] will be updated in-place
~ resource "aws_route_table" "private" {
        id               = "rtb-03f73d36881e0dc02"
        owner_id         = "259016875510"
        propagating_vgws = []
        route            = []
      ~ tags             = {
            "Attributes"                                                   = "private"
          ~ "Name"                                                         = "bemit-testing-test-k8s-cluster-private-eu-west-1a" -> "bemit-testing-johnholm-private-eu-west-1a"
            "Namespace"                                                    = "bemit"
            "Stage"                                                        = "testing"
            "cpco.io/subnet/type"                                          = "private"
          + "kubernetes.io/cluster/bemit-testing-johnholm-cluster"         = "shared"
          - "kubernetes.io/cluster/bemit-testing-test-k8s-cluster-cluster" = "shared" -> null
        }
        vpc_id           = "vpc-01464930072e8714a"
    }

  # module.test-k8s-cluster.module.subnets.aws_route_table.private[1] will be updated in-place
~ resource "aws_route_table" "private" {
        id               = "rtb-0bb0b3ddda38236d6"
        owner_id         = "259016875510"
        propagating_vgws = []
        route            = []
      ~ tags             = {
            "Attributes"                                                   = "private"
          ~ "Name"                                                         = "bemit-testing-test-k8s-cluster-private-eu-west-1b" -> "bemit-testing-johnholm-private-eu-west-1b"
            "Namespace"                                                    = "bemit"
            "Stage"                                                        = "testing"
            "cpco.io/subnet/type"                                          = "private"
          + "kubernetes.io/cluster/bemit-testing-johnholm-cluster"         = "shared"
          - "kubernetes.io/cluster/bemit-testing-test-k8s-cluster-cluster" = "shared" -> null
        }
        vpc_id           = "vpc-01464930072e8714a"
    }

  # module.test-k8s-cluster.module.subnets.aws_route_table.public[0] will be updated in-place
~ resource "aws_route_table" "public" {
        id               = "rtb-068de0d92d856d2fd"
        owner_id         = "259016875510"
        propagating_vgws = []
        route            = [
            {
                cidr_block                = "0.0.0.0/0"
                egress_only_gateway_id    = ""
                gateway_id                = "igw-046cdf44f6bf1e4b0"
                instance_id               = ""
                ipv6_cidr_block           = ""
                nat_gateway_id            = ""
                network_interface_id      = ""
                transit_gateway_id        = ""
                vpc_peering_connection_id = ""
            },
        ]
      ~ tags             = {
            "Attributes"                                                   = "public"
          ~ "Name"                                                         = "bemit-testing-test-k8s-cluster" -> "bemit-testing-johnholm"
            "Namespace"                                                    = "bemit"
            "Stage"                                                        = "testing"
            "cpco.io/subnet/type"                                          = "public"
          + "kubernetes.io/cluster/bemit-testing-johnholm-cluster"         = "shared"
          - "kubernetes.io/cluster/bemit-testing-test-k8s-cluster-cluster" = "shared" -> null
        }
        vpc_id           = "vpc-01464930072e8714a"
    }

  # module.test-k8s-cluster.module.subnets.aws_subnet.private[0] will be updated in-place
~ resource "aws_subnet" "private" {
        arn                             = "arn:aws:ec2:eu-west-1:259016875510:subnet/subnet-0dfa93d1131c54381"
        assign_ipv6_address_on_creation = false
        availability_zone               = "eu-west-1a"
        availability_zone_id            = "euw1-az1"
        cidr_block                      = "172.16.0.0/19"
        id                              = "subnet-0dfa93d1131c54381"
        map_public_ip_on_launch         = false
        owner_id                        = "259016875510"
      ~ tags                            = {
            "Attributes"                                                   = "private"
          ~ "Name"                                                         = "bemit-testing-test-k8s-cluster-private-eu-west-1a" -> "bemit-testing-johnholm-private-eu-west-1a"
            "Namespace"                                                    = "bemit"
            "Stage"                                                        = "testing"
            "cpco.io/subnet/type"                                          = "private"
          + "kubernetes.io/cluster/bemit-testing-johnholm-cluster"         = "shared"
          - "kubernetes.io/cluster/bemit-testing-test-k8s-cluster-cluster" = "shared" -> null
        }
        vpc_id                          = "vpc-01464930072e8714a"
    }

  # module.test-k8s-cluster.module.subnets.aws_subnet.private[1] will be updated in-place
~ resource "aws_subnet" "private" {
        arn                             = "arn:aws:ec2:eu-west-1:259016875510:subnet/subnet-00946e3fa0a8dd528"
        assign_ipv6_address_on_creation = false
        availability_zone               = "eu-west-1b"
        availability_zone_id            = "euw1-az2"
        cidr_block                      = "172.16.32.0/19"
        id                              = "subnet-00946e3fa0a8dd528"
        map_public_ip_on_launch         = false
        owner_id                        = "259016875510"
      ~ tags                            = {
            "Attributes"                                                   = "private"
          ~ "Name"                                                         = "bemit-testing-test-k8s-cluster-private-eu-west-1b" -> "bemit-testing-johnholm-private-eu-west-1b"
            "Namespace"                                                    = "bemit"
            "Stage"                                                        = "testing"
            "cpco.io/subnet/type"                                          = "private"
          + "kubernetes.io/cluster/bemit-testing-johnholm-cluster"         = "shared"
          - "kubernetes.io/cluster/bemit-testing-test-k8s-cluster-cluster" = "shared" -> null
        }
        vpc_id                          = "vpc-01464930072e8714a"
    }

  # module.test-k8s-cluster.module.subnets.aws_subnet.public[0] will be updated in-place
~ resource "aws_subnet" "public" {
        arn                             = "arn:aws:ec2:eu-west-1:259016875510:subnet/subnet-03f7cbd6793880802"
        assign_ipv6_address_on_creation = false
        availability_zone               = "eu-west-1a"
        availability_zone_id            = "euw1-az1"
        cidr_block                      = "172.16.96.0/19"
        id                              = "subnet-03f7cbd6793880802"
        map_public_ip_on_launch         = true
        owner_id                        = "259016875510"
      ~ tags                            = {
            "Attributes"                                                   = "public"
          ~ "Name"                                                         = "bemit-testing-test-k8s-cluster-public-eu-west-1a" -> "bemit-testing-johnholm-public-eu-west-1a"
            "Namespace"                                                    = "bemit"
            "Stage"                                                        = "testing"
            "cpco.io/subnet/type"                                          = "public"
          + "kubernetes.io/cluster/bemit-testing-johnholm-cluster"         = "shared"
          - "kubernetes.io/cluster/bemit-testing-test-k8s-cluster-cluster" = "shared" -> null
        }
        vpc_id                          = "vpc-01464930072e8714a"
    }

  # module.test-k8s-cluster.module.subnets.aws_subnet.public[1] will be updated in-place
~ resource "aws_subnet" "public" {
        arn                             = "arn:aws:ec2:eu-west-1:259016875510:subnet/subnet-02b402d2224b8504d"
        assign_ipv6_address_on_creation = false
        availability_zone               = "eu-west-1b"
        availability_zone_id            = "euw1-az2"
        cidr_block                      = "172.16.128.0/19"
        id                              = "subnet-02b402d2224b8504d"
        map_public_ip_on_launch         = true
        owner_id                        = "259016875510"
      ~ tags                            = {
            "Attributes"                                                   = "public"
          ~ "Name"                                                         = "bemit-testing-test-k8s-cluster-public-eu-west-1b" -> "bemit-testing-johnholm-public-eu-west-1b"
            "Namespace"                                                    = "bemit"
            "Stage"                                                        = "testing"
            "cpco.io/subnet/type"                                          = "public"
          + "kubernetes.io/cluster/bemit-testing-johnholm-cluster"         = "shared"
          - "kubernetes.io/cluster/bemit-testing-test-k8s-cluster-cluster" = "shared" -> null
        }
        vpc_id                          = "vpc-01464930072e8714a"
    }

  # module.test-k8s-cluster.module.vpc.aws_internet_gateway.default will be updated in-place
~ resource "aws_internet_gateway" "default" {
        id       = "igw-046cdf44f6bf1e4b0"
        owner_id = "259016875510"
      ~ tags     = {
          ~ "Name"                                                         = "bemit-testing-test-k8s-cluster" -> "bemit-testing-johnholm"
            "Namespace"                                                    = "bemit"
            "Stage"                                                        = "testing"
          + "kubernetes.io/cluster/bemit-testing-johnholm-cluster"         = "shared"
          - "kubernetes.io/cluster/bemit-testing-test-k8s-cluster-cluster" = "shared" -> null
        }
        vpc_id   = "vpc-01464930072e8714a"
    }

  # module.test-k8s-cluster.module.vpc.aws_vpc.default will be updated in-place
~ resource "aws_vpc" "default" {
        arn                              = "arn:aws:ec2:eu-west-1:259016875510:vpc/vpc-01464930072e8714a"
        assign_generated_ipv6_cidr_block = true
        cidr_block                       = "172.16.0.0/16"
        default_network_acl_id           = "acl-0bf198a90ee86269a"
        default_route_table_id           = "rtb-0d7ae97bc22ebc082"
        default_security_group_id        = "sg-0605218868e750927"
        dhcp_options_id                  = "dopt-9a4edffc"
        enable_classiclink               = false
        enable_classiclink_dns_support   = false
        enable_dns_hostnames             = true
        enable_dns_support               = true
        id                               = "vpc-01464930072e8714a"
        instance_tenancy                 = "default"
        ipv6_association_id              = "vpc-cidr-assoc-057d1363ab2c5f684"
        ipv6_cidr_block                  = "2a05:d018:e8d:ba00::/56"
        main_route_table_id              = "rtb-0d7ae97bc22ebc082"
        owner_id                         = "259016875510"
      ~ tags                             = {
          ~ "Name"                                                         = "bemit-testing-test-k8s-cluster" -> "bemit-testing-johnholm"
            "Namespace"                                                    = "bemit"
            "Stage"                                                        = "testing"
          + "kubernetes.io/cluster/bemit-testing-johnholm-cluster"         = "shared"
          - "kubernetes.io/cluster/bemit-testing-test-k8s-cluster-cluster" = "shared" -> null
        }
    }

  # module.test-k8s-cluster.module.eks_workers.module.autoscale_group.aws_autoscaling_group.default[0] will be created
+ resource "aws_autoscaling_group" "default" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = 300
      + desired_capacity          = (known after apply)
      + enabled_metrics           = [
          + "GroupDesiredCapacity",
          + "GroupInServiceInstances",
          + "GroupMaxSize",
          + "GroupMinSize",
          + "GroupPendingInstances",
          + "GroupStandbyInstances",
          + "GroupTerminatingInstances",
          + "GroupTotalInstances",
        ]
      + force_delete              = false
      + health_check_grace_period = 300
      + health_check_type         = "EC2"
      + id                        = (known after apply)
      + load_balancers            = (known after apply)
      + max_size                  = 4
      + metrics_granularity       = "1Minute"
      + min_elb_capacity          = 0
      + min_size                  = 2
      + name                      = (known after apply)
      + name_prefix               = "bemit-testing-johnholm-"
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + tags                      = [
          + {
              + "key"                 = "Attributes"
              + "propagate_at_launch" = "true"
              + "value"               = "workers"
            },
          + {
              + "key"                 = "Name"
              + "propagate_at_launch" = "true"
              + "value"               = "bemit-testing-johnholm-workers"
            },
          + {
              + "key"                 = "Namespace"
              + "propagate_at_launch" = "true"
              + "value"               = "bemit"
            },
          + {
              + "key"                 = "Stage"
              + "propagate_at_launch" = "true"
              + "value"               = "testing"
            },
          + {
              + "key"                 = "kubernetes.io/cluster/bemit-testing-johnholm-cluster"
              + "propagate_at_launch" = "true"
              + "value"               = "owned"
            },
        ]
      + target_group_arns         = (known after apply)
      + termination_policies      = [
          + "Default",
        ]
      + vpc_zone_identifier       = [
          + "subnet-02b402d2224b8504d",
          + "subnet-03f7cbd6793880802",
        ]
      + wait_for_capacity_timeout = "10m"
      + wait_for_elb_capacity     = 0

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = "$Latest"
        }
    }

  # module.test-k8s-cluster.module.eks_workers.module.autoscale_group.aws_launch_template.default[0] will be created
+ resource "aws_launch_template" "default" {
      + arn                                  = (known after apply)
      + default_version                      = (known after apply)
      + disable_api_termination              = false
      + ebs_optimized                        = "false"
      + id                                   = (known after apply)
      + image_id                             = "ami-0eb6419458800872a"
      + instance_initiated_shutdown_behavior = "terminate"
      + instance_type                        = "t3a.small"
      + latest_version                       = (known after apply)
      + name                                 = (known after apply)
      + name_prefix                          = "bemit-testing-johnholm-"
      + tags                                 = {
          + "Attributes"                                           = "workers"
          + "Name"                                                 = "bemit-testing-johnholm-workers"
          + "Namespace"                                            = "bemit"
          + "Stage"                                                = "testing"
          + "kubernetes.io/cluster/bemit-testing-johnholm-cluster" = "owned"
        }
      + user_data                            = (known after apply)

      + iam_instance_profile {
          + name = "bemit-testing-johnholm-workers"
        }

      + monitoring {
          + enabled = true
        }

      + network_interfaces {
          + associate_public_ip_address = "false"
          + delete_on_termination       = true
          + description                 = "bemit-testing-johnholm"
          + device_index                = 0
          + security_groups             = (known after apply)
        }

      + tag_specifications {
          + resource_type = "volume"
          + tags          = {
              + "Attributes"                                           = "workers"
              + "Name"                                                 = "bemit-testing-johnholm-workers"
              + "Namespace"                                            = "bemit"
              + "Stage"                                                = "testing"
              + "kubernetes.io/cluster/bemit-testing-johnholm-cluster" = "owned"
            }
        }
      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Attributes"                                           = "workers"
              + "Name"                                                 = "bemit-testing-johnholm-workers"
              + "Namespace"                                            = "bemit"
              + "Stage"                                                = "testing"
              + "kubernetes.io/cluster/bemit-testing-johnholm-cluster" = "owned"
            }
        }
    }

Plan: 20 to add, 11 to change, 15 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](http://34.247.12.82/lock?id=bmtoml%252Fatlaaaaaaantis%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
